#include <iostream>

void task1();




int main()
{
    
    task1();





}


/*
1. Создайте массив состоящий из элемениов 9,8,7,6,5,4,3,2,1,0.
Выведите на экран только элементы с чётными индексами.
*/

void task1()
{



}




































/*
1. Создайте массив состоящий из элемениов 9,8,7,6,5,4,3,2,1,0.
Выведите на экран только элементы с чётными индексами.

2. Создайте массив состоящий из элемениов 9,8,7,6,5,4,3,2,1,0.
Выведите на экран в обратном порядке только элементы с нечётными индексами.

3. Создайте массив состоящий из элемениов 9,8,7,6,5,4,3,2,1,0.
Выведите на экран сумму элементов массива, не кратных 3.

4. Создайте массив состоящий из 20 целочисленных элементов.
Заполните массив квадратами чисел начиная с 1 (т.е. 1, 4, 9...). Выведите значения массива на экран.

5. Создайте массив из 11 элементов, организуйте ввод элементов массива с клавиатуры,
выведите на экран все элементы массива в строку разделяя элементы одним пробелом.
Инвертируйте элементы массива относительно центра (например если было 0,1,2,3,4,5,6,7,8,9,10,
должно стать 10,9,8,7,6,5,4,3,2,1,0). Выведите значения массива на экран.

6. Создайте двумерный массив 10x10 целочисленных элементов.
Заполните его значениями по следующему принципу: значением элемента массива является двузначное число,
в разряде десятков которого записан номер строки, а в разряде единиц - номер столбца. Вывести значения массива на экран.

7. Создайте двумерный массив 10x10 целочисленных элементов.
Заполните его значениями по следующему принципу: значением элемента массива является произведение его индексов.
Вывести значения массива на экран. Посчитать сумму элементов массив на главной диагонали массива и вывести её на экран.



*/


